
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.juror-public-redis.azurerm_redis_cache.redis
* Replace
  * azurerm_key_vault_secret.redis_connection_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "redis_connection_string" {
      ~ id                      = "https://juror-stg.vault.azure.net/secrets/public-redis-connection-string/b4b86adc8bc04cf6810e6258b50ae166" -> (known after apply)
      ~ name                    = "public-redis-connection-string" -> "public-redisConnection" # forces replacement
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/public-redis-connection-string/versions/b4b86adc8bc04cf6810e6258b50ae166" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/public-redis-connection-string" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "b4b86adc8bc04cf6810e6258b50ae166" -> (known after apply)
      ~ versionless_id          = "https://juror-stg.vault.azure.net/secrets/public-redis-connection-string" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.juror-public-redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-public-redis-cache-cache-stg/providers/Microsoft.Cache/redis/juror-public-redis-cache-stg"
        name                          = "juror-public-redis-cache-stg"
        tags                          = {
            "application"         = "juror"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/juror-public.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#juror-dev"
            "environment"         = "staging"
            "managedBy"           = "Juror"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 125 -> 642
          ~ maxmemory_delta                 = 125 -> 642
          ~ maxmemory_reserved              = 125 -> 642
            # (7 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"","Vars":{}} -->